In [1]:
import pandas as pd
from datasets import load_dataset

# Loading dataset
dataset = load_dataset("lukebarousse/data_jobs")
df = dataset['train'].to_pandas()

# data cleanup
df['job_posted_date'] = pd.to_datetime(df.job_posted_date)

In [2]:
df1=df.copy()
type(df1.job_skills[1])

str

* converting the `str` type into `list` using python's `ast` module.
* Apply to dataframe using apply function.

In [3]:
import ast

def clean_list(skill_list):
    if pd.notna(skill_list):                           # to eliminate None,Na
        return ast.literal_eval(skill_list)
    
df1['job_skills'] = df1['job_skills'].apply(clean_list)

In [4]:
type(df1['job_skills'][1])

list

In [5]:
# Using lambda function
df['job_skills'] = df['job_skills'].apply(
    lambda skill_list: ast.literal_eval(skill_list) if pd.notna(skill_list) else skill_list)

type(df['job_skills'][1])

list

## Calculate projected salary next year

* Senior roles assume 5%
* Other roles assue 3%

In [14]:
df_salary = df[df['salary_year_avg'].notna()].copy()

In [15]:
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(lambda salary:salary * 1.03)
df_salary[['salary_year_avg','salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

In [16]:
def projected_salary(row):
    if "Senior" in row['job_title_short']:
        return 1.05 * row['salary_year_avg']
    else:
        return 1.03 * row['salary_year_avg']

df_salary['salary_year_inflated'] = df_salary.apply(projected_salary,axis=1)

df_salary[['job_title_short', 'salary_year_avg','salary_year_inflated']]

       job_title_short  salary_year_avg  salary_year_inflated
28      Data Scientist         109500.0             112785.00
77       Data Engineer         140000.0             144200.00
92       Data Engineer         120000.0             123600.00
100     Data Scientist         228222.0             235068.66
109       Data Analyst          89000.0              91670.00
...                ...              ...                   ...
785624   Data Engineer         139216.0             143392.48
785641   Data Engineer         150000.0             154500.00
785648  Data Scientist         221875.0             228531.25
785682  Data Scientist         157500.0             162225.00
785692  Data Scientist         157500.0             162225.00

[22003 rows x 3 columns]